// pages/random/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    cardClicked:false,
    flippedCardId:-1,
    shouldShowResult:false,
    clause:"",
    publishments: ["我是真心话，初吻是什么时候、在哪里发生？","我是大冒险,与场上异性拍照假装情侣并发朋友圈","我是真心话,最喜欢（恋爱的喜欢）在座哪位异性", "我是真心话,讲述发生的最糗的一件事情", "我是真心话,内裤颜色", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,持续走猫步1分钟", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,男用胳膊从正面量女的胸围or女量男的腰围", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,与同性正面相隔做接吻陶醉状10秒", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,摆3个芙蓉姐姐S形", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,跪地求婚状：如果我不向你求婚，我会后悔一辈子，因为你是我的惟一。（理察·基尔致朱丽叶·罗伯茨（在电影《逃跑的新娘》中）", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,口含一口水并喊：\"燃烧吧，小宇宙～\"", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,表演希瑞：“我叫阿多拉，希曼的亲妹妹。这是顺风马，我的坐骑。我有一个不为人知的秘密，当我抽出剑叫道：“赐予我力量吧，我是希瑞！” 只有三个人知道这个秘密，他们是：希望之光，拉兹夫人，和考尔。我和其他的朋友们一道，为解救以希利亚，与罪恶的霍达克进行着战斗！”", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,选一个女生说 ：我将把你紧紧地搂在怀中，吻你亿万次，像在赤道上面那样炽烈的吻。（拿破仑致约瑟芬）", "我是大冒险,选一个男生 一边捶他的胸一边说： 你好讨厌哦","我是大冒险, 躺在床上摆pose说：饭在锅里，我在床上。","我是大冒险, 一人先用嘴吸住一纸牌，另一人用嘴从另一面将纸牌吸住移走。","我是大冒险, 仰躺地上，异性撑在上面，做五下俯卧撑。","我是真心话, 小时候第一次挨揍或被老师狠批的具体经过？","我是真心话, 你对10、20、50年后的相貌预测？及生活状态？","我是真心话, 如果看到自己最爱的人熟睡在你面前你会做什么？","我是真心话, 曾经有过最被感动的事是什么？","我是真心话, 你最想要的5样东西","我是真心话, 如果时间能倒流你希望回到哪一时间？","我是真心话, 你心目中理想的爱人是什么样子呢？","我是真心话, 你会如何向喜欢的人表白？ ","我是真心话, 世界末日，你会幸存，并且你可以救一个人，你会怎么做？","我是真心话, 如果让你选择做一个电影中的角色，你会选谁呢？","我是真心话, 你最不开心的时候会有什么表现？","我是真心话, 在爱情和面包中，你会选择哪个？为什么？","我是大冒险,.随便给手机里的一个异性打电话。说：其实.....我是....猪。","我是大冒险, 把从你右手边数起第三位异性的腿架在肩上替其捶腿，边说“大爷您舒服吗？”","我是大冒险, 抱一位离你最远的异性直到下一轮真心话大冒险结束。","我是大冒险, 围绕屋子跑一圈，并喊：我再也不尿床啦。 ","我是大冒险, 用笔在头上画一个乌龟，直到游戏结束。","我是大冒险, 与离你最近的异性相遇，男生说：\"你好，我姓锄名禾，你呢？\"女生说：\"我名叫当午。\"男生女生同时说：\"哦！原来是锄禾日当午啊！\"","我是大冒险, 去肯德基或麦当劳买一杯可乐，等店员问你要中杯还是大杯时说:我要D罩杯。（可下次执行）","我是大冒险,对着门外喊“打雷了，下雨收衣服啊”","我是大冒险,大喊三声“我卖身不卖艺啊”", "我是大冒险,和你右手边数起第三位异性拥抱（紧紧的），保持5秒钟。", "我是大冒险,对一个陌生人大喊2声“我是禽兽”。", "我是大冒险,模仿喝一杯烈酒的样子喝完一杯白开水。","我是大冒险,与在座每个人深情拥抱一下。","我是大冒险,穿自己的外套表演张倾城之“我脱、我穿、我再脱、我再穿” ", "我是大冒险,深情的望着离你最远的异性为其唱一首情歌。",  "我是大冒险,买一只冰棒，然后问店员“吃这个要连包装纸一起吃的么？”", "右上角转发此小程序到你消息列表的第3个人/群！", "我是大冒险,正面对着十指交扣，深情对视，深情朗诵骆宾王的《鹅》。",  "我是大冒险,用手纸当围巾，围脖子上持续一轮游戏。",  "我是大冒险,右手捏住左耳垂，弯下腰，顺时针转10圈，再金鸡独立15秒不许倒。", "我是大冒险,蹲凳子上上做便秘状10秒钟",  "我是大冒险,用舌头舔肘部",  "我是大冒险,做个鬼脸，要观众满意 ", "我是真心话,如果让你从现场找一位gg/mm的话，你会选择谁?给出三个理由。 ","我是真心话, 最欣赏自己哪个部位 ? 对自己那个部位最不满意 ? ","我是真心话, 要是妈妈和女友同时掉到水里会救谁先呢 ? ","我是大冒险, 唱青藏高原最后一句","我是真心话, 你的仇人在上厕所时，没纸出不来，你怎么办 ? ","我是真心话, 半夜遇见劫匪，他说不唱歌不让你走，你会唱什么 ? ","我是真心话, 雀斑，高度近视，大饼脸，象腿，粗腰，让你选一个当老婆 / 老公，你会选择 ? ","我是真心话, 你觉得自己最郁闷的外号是什么 ? ","我是真心话, 目前为止你做过的最疯狂的事是什么 ? ","我是真心话, 你觉得自己放的屁臭不臭。","我是真心话, 情人节最想收到什么礼物 ? ","我是大冒险, 学水兵月做动作，然后对一个人說:我要代替月亮懲罰你!!","我是大冒险, 亲一位异性。由异性制定部位。部位不限。","我是大冒险, 神情的吻墙5秒。","我是真心话, 在你洗澡时，有一个非常丑的异性冲了进来，你会怎么样（实话实说，希望不要采用极端手法）","我是真心话, 你觉得你曾经喜欢的人和在座哪个人最像？","我是真心话, 在场哪一位异性对你说我喜欢你，你会最开心？","我是真心话, 洗澡洗到一半没水了怎么办？（注意是身上有泡沫的时候）","我是真心话, 你觉得对面那个人那个部位最好看？","我是大冒险, 从异性腰背后双手摸过搂住ta的腰，下巴放在ta肩上，坚持5秒","我是大冒险, 选一位异性，互摸嘴唇","我是大冒险, 靠在异性玩家肚子上并说：老婆几个月了。","我是真心话, 学生妹、女超人、肚兜、女警、护士、旗袍、蕾丝选一个。","我是真心话, 你能确定自己的性取向么？喜欢男的还是女的？","我是真心话, 巧克力味的粑粑和粑粑味儿的巧克力。吃哪个？","我是真心话, 第一次看少儿不宜的东西是几岁？","我是真心话, 现在看你的左边，看到第一样东西什么（实话实说）","我是真心话, 有史以来被骂的最惨的一次是什么，为什么","我是真心话, 你经常裸睡吗（实话实说）","我是真心话, 用四个字形容你的长相","我是真心话, 你有多长时间没有被别人告白过了？","我是真心话, 有一句话你一直不敢对你喜欢的人说 说出来", "我是真心话,上厕所，结果发现没有纸，只有100元and最爱的那个人的照片....你用哪个？", "我是真心话,给你的情敌留下一句话", "我是真心话,如果有一天，你爸妈告诉你其实你不是他们亲生的，怎么办？","我是大冒险, 蹲墙角对大家唱征服","我是大冒险, 做自己最性感、最妩媚的表情或动作","我是大冒险, 慢慢地性感地把上衣撩起到不能再撩起的位置（看到皮肤）；","我是大冒险, 对陌生人美眉挤眉弄眼并让对方注意到你","我是大冒险, 原地转10圈（就近靠下）","我是大冒险, 十指交扣握住 保持一轮。","我是大冒险, 亲左数第二个 异性的额头。","我是大冒险, 和左边第一个 异性换穿上衣。","我是真心话, 说出京杭大运河的经过的中国五大水系。","我是大冒险, 左手拉右耳，右手拉左耳，从桌子底下过。","我是大冒险, 和右边第二个 异性，一个演水兵月，一个演超兽，然后水兵月要把超兽打倒。","我是大冒险, 和右边第一个异性关在厕所里等一轮游戏。","我是大冒险, 与异性贴身热舞（不会跳舞就靠着异性扭动，可自配音乐）","我是大冒险, 绕着全场一遍唱套马的汉子", "右上角转发此小程序到你消息列表的第3个人/ 群！"]
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    this.setData({
      flippedCardId: -1
    })
  },

  chosenCardClicked:function(){
    this.setData({
      flippedCardId: -1,
      shouldShowResult:false,
      cardClicked:false
    })
  },

  cardClicked:function(e) {
    if (!this.data.cardClicked){
      this.setData({
        cardClicked:true
      })

      let no = Math.floor(Math.random() * (this.data.publishments.length - 1))
      // console.log(no)
      // console.log(this.data.publishments[no])
      if (this.data.flippedCardId == -1) {
        this.setData({
          clause: this.data.publishments[no],
          flippedCardId: e.currentTarget.dataset.id
        })
      }

      setTimeout(() => {
        this.setData({
          shouldShowResult: true
        })
      }, 500)
    }
    
  },
  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})